import { Container, Row, Col } from "react-bootstrap";
import colorSharp2 from "../Assets/Pics/color-sharp2.png";
import army from "../Assets/Pics/armyLogo.png";
import Tabs from "./Tabs";

export const AboutPage = () => {


    return (
        <section className="About" id="About" dir="rtl">
            <Container>
                <Row>
                    <Col>
                        <h2>   مقدمه عن مركز التأمين الفني</h2>
                        <div style={{
                            justifycontent: "space-around",/* Space out the divs */
                            backgroundcolor: "#f4f4f4", /* Background color for the container */
                            padding: "20px",
                            borderradius: "8px"
                        }}>
                            
                            <div className="Aboutcard" dir="rtl">
                                <div className="AboutTittle">١- نبذه تاريخيه عن مركز التأمين الفني</div>
                                <p className="AboutDescription">
                                    قام الجانب الأمريكي بإداره الإمداد الألى و السيطرة علي المخزون MMC في الفتره من عام 1994 إلي عام 2005
                                    <br></br>
                                    قامت إداره نظم و معلومات  للقوات المسلحة بتولي مسئولية إداره منظومة الإمداد الألى و السيطرة علي المخزون MMC في عام 2005
                                    <br></br>
                                    حيث تم إنشاء مركز التأمين الفني لمنظومة الامداد الألي و السيطرةعلي المخزون MMC كإحدى وحدات إداره نظم المعلومات في 20/5/2005 بتعليمات رقم (6868) بتاريخ 20/2/2006 .
                                </p>
                            </div>

                            <div className="Aboutcard" dir="rtl">
                                <div className="AboutTittle">٢-  تعريف المنظومه </div>
                                <p className="AboutDescription">
                                    تعتبر منظومة الإمداد الألي و السيطره علي المخزون بالقوات المسلحة نظام متكامل للسيطره علي الأتي :
                                    <br></br>
                                    - دوره الإمداد بأصناف الاإحتياجات الفنية للقوات المسلحة بدءا من  الاإحتياجات الفنيه و تدبيرها ثم وصول الأصناف الي موانئ الوصول و استقبالها حتي تمام الوصول الي مستودعات الإضافه و الصرف منها و مراقبه المخزون و السيطرة عليه حتي تكهينه او اعدامه او الإستغناء عنه
                                    <br></br>
                                    - دورة الإصلاح و الصيانه لمعدات القوات المسلحه و التي يتم من خلالها متابعه المعدات و السيطرة عليها أثناء مراحل الصيانه و مستويات الاصلاح المختلفه
                                </p>
                            </div>

                            <div className="Aboutcard" dir="rtl">
                                <div className="AboutTittle">٣-  عناصر المنظومه </div>
                                <img src="" alt="img"></img>
                            </div>

                            <div className="Aboutcard" dir="rtl">
                                <div className="AboutTittle">٤-  تعريف المنظومه </div>
                                <p className="AboutDescription">
                                    - ميكنه دورات العمل المستندية اليدوية (الإضافة / الخصم  / الجرد /الإصلاح / التكهين) و ذلك توفيرا للوقت و الجهد و تقليلا للتكلفه .
                                    <br></br>
                                    - تقليل الخطأ البشري بالإعتماد علي منظومه معلوماتيه متكاملة من خلال صلاحيات محددة للمستخدمين و متخذي القرار .
                                    <br></br>
                                    - ضمان سرعة الإمداد بالأصناف الموجوه في الوقا المحدد .
                                    <br></br>
                                    - المناورة بالأصناف البديلة بين المستودعات  و الإدارات عند الضروره من خلال المستوي الاعلي و طبقا للصلاحيات المحددة
                                    <br></br>
                                    - سهولة معرفة الأصناف ذات معدلات الاأستهلاك المرتفعة لضمان سرعة تدبيرها
                                    <br></br>
                                    - ترشيد تدبير الأصناف من خلال الإطلاع علي مستويات المخزون الراكد بالمستودعات .
                                    <br></br>
                                    - توفير رؤية متكاملة لمختلف مستويات الإمداد بالأصناف المتعاقد عليها خلال دورة التوريد و حتي الإضافة بالمستودعات .
                                    <br></br>
                                    - دعم متخذي القرار علي المستويات المختلفه عن طريق إتاحة معلومات إحصائية و تحليلية عن الموجودات و الأرصده .
                                    <br></br>
                                    - ترشيد المأموريات و تقليل التحركات مما يؤدي الي توفير نفقات هائله علي القوات المسلحه بالأضافه الي تقليل نقل البيانات .
                                    <br></br>
                                    -تنفيذ عمليات الجرد الدوري و المفاجئ لتحديد الإخنلاف بين الرصيد الدفتري و الموجود الفعلي بالمخازن و الاقسام .
                                </p>
                            </div>

                        </div>

                        <h2>  المهام الرئيسيه لمركز التأمين الفني</h2>
                        <div style={{
                            justifycontent: "space-around",/* Space out the divs */
                            backgroundcolor: "#f4f4f4", /* Background color for the container */
                            padding: "20px",
                            borderradius: "8px"
                        }}>
                            
                            <div className="Aboutcard" dir="rtl">
                                <p className="AboutDescription">

                                -تعميم منظومة الإمداد الألي و السيطرة علي المخزون MMC بالوحدات الجديدة من خلال (معاينه المواقع / تدريب الأفراد / ترتيب المخازن / تكويد الأصناف ظ إعداد الأجهزه و المعدات).
                                    <br></br>
-تنفيذ خطه الإحلال و التطوير لأجهزه و معدات النظم المتقادمة في الوحدات .
                                    <br></br>
-إدارة و تطوير قواعد البيانات الخاصة بمنظومة الإمداد الألي و السيطرة علي المخزون MMC .
<br></br>
-ميكنة و تطوير و إختبار دورات العمل الخاصة بمنظومة الإمداد الألي و السيطرة علي المخزون MMC . 
<br></br>
-إدارة و مراقبة إجراءات تأمين البيانات بالمنظومة
<br></br>
- إعداد  و تنفيذ دورات تدريبيه لمستخدمي المنظومة (أفرع فنيه / ورش و مستودعات / أفواج التشهيلات).
<br></br>
- أستقبال كل من المطالب الجديده و بلاغات الأعطال من خلال منظومه تلقي بلاغات الأعطال و التأكد من أصلاحها (تليفونيا / بالمواقع).
<br></br>
- تطبيق أحدث منهجيات الجودة العالميه من خلال إنشاء اسلوب قياسي يحقق أعلي معدلات الأداء و التطوير المستمر لأليه العمل بالمركز .
<br></br>
-حفظ و توثيق جميع الوثائق الفنية و الأصدارات الخاصة بمنظومة الإمداد الألي و السيطرة علي الخزون MMC .
<br></br>
- عمل نسخ إحطياطيه (قواعد البيانات / إصدارات التطبيقات / الخوادم الرئيسية).
                                </p>
                            </div>
                        </div>

                        <h2>  المواقع العاملة بمنظومة الإمداد الألى </h2>
                        
                        <div style={{
                            justifycontent: "space-around",/* Space out the divs */
                            backgroundcolor: "#f4f4f4", /* Background color for the container */
                            padding: "20px",
                            borderradius: "8px"
                        }}>
                          <div className="TabsCard">
                          <Tabs/>
                          </div>
                          
                        </div>
                    </Col>
                </Row>
            </Container>
            <img src={colorSharp2} className="background-image-right" alt="img"></img>
        </section>
    )
}